///////////////////////////////////
// 
// ui.h
// 
// Author: BAYAR "HekSeon" SEMIH
///////////////////////////////////
#pragma once

#include "main.h"

//*****************************************************************************
// マクロ定義 (Macros)
//*****************************************************************************
#define DIGIT_MAX			(99999)		// スコアの最大値
#define HEALT_DIGIT			(3)			// 体力の桁数

//*****************************************************************************
// プロトタイプ宣言 (Prototypes)
//*****************************************************************************
HRESULT InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);
int GetUI(void);